There is a need of writing a note for this topic

Decision tree is a type of machine learning algorithims that involve splitting of datasets based on decision made.

There are some terms that are very important to take note of which is the following

1. entropy : this is the degree of randomness of datasets
    
2. Information gain : this is the ability to gain information based on the situation of the datasets.

3. Gini Impurity : this is the residual that remains in a very large part of a split datasets

<h3>Practical class on Decision Tree</h3>

In [4]:
#import libraries
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [5]:
#load the datasets
df_dtree = pd.read_csv("py-master/ML/9_decision_tree/salaries.csv")

In [6]:
#get the top five rows
df_dtree.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [7]:
inputs =  df_dtree.drop("salary_more_then_100k" , axis = "columns")
inputs

       company                  job     degree
0       google      sales executive  bachelors
1       google      sales executive    masters
2       google     business manager  bachelors
3       google     business manager    masters
4       google  computer programmer  bachelors
5       google  computer programmer    masters
6   abc pharma      sales executive    masters
7   abc pharma  computer programmer  bachelors
8   abc pharma     business manager  bachelors
9   abc pharma     business manager    masters
10    facebook      sales executive  bachelors
11    facebook      sales executive    masters
12    facebook     business manager  bachelors
13    facebook     business manager    masters
14    facebook  computer programmer  bachelors
15    facebook  computer programmer    masters

In [8]:
target = df_dtree.iloc[: , 3]

In [9]:
target

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [10]:
from sklearn.preprocessing import LabelEncoder

In [12]:
Le_company = LabelEncoder()
Le_job = LabelEncoder()
Le_degree = LabelEncoder()

In [13]:
inputs["company_n"] = Le_company.fit_transform(inputs["company"])
inputs["job_n"] = Le_job.fit_transform(inputs["job"])
inputs["degree_n"] = Le_degree.fit_transform(inputs["degree"])

In [15]:
inputs

       company                  job     degree  company_n  job_n  degree_n
0       google      sales executive  bachelors          2      2         0
1       google      sales executive    masters          2      2         1
2       google     business manager  bachelors          2      0         0
3       google     business manager    masters          2      0         1
4       google  computer programmer  bachelors          2      1         0
5       google  computer programmer    masters          2      1         1
6   abc pharma      sales executive    masters          0      2         1
7   abc pharma  computer programmer  bachelors          0      1         0
8   abc pharma     business manager  bachelors          0      0         0
9   abc pharma     business manager    masters          0      0         1
10    facebook      sales executive  bachelors          1      2         0
11    facebook      sales executive    masters          1      2         1
12    facebook     business manager  bachelors          1      0         0
13    facebook     business manager    masters          1      0         1
14    facebook  computer programmer  bachelors          1      1         0
15    facebook  computer programmer    masters          1      1         1

In [16]:
input_n = inputs.drop(["company" , "job" , "degree"] , axis = "columns")

In [18]:
input_n.head()

   company_n  job_n  degree_n
0          2      2         0
1          2      2         1
2          2      0         0
3          2      0         1
4          2      1         0

In [19]:
from sklearn import tree

In [21]:
model = tree.DecisionTreeClassifier()

In [23]:
model.fit( input_n , target)

DecisionTreeClassifier()

In [24]:
model.score(input_n , target)

1.0

In [25]:
model.predict([[2,2,1]])

array([0], dtype=int64)

<h3>Exercise</h3>

In [71]:
df_titanic = pd.read_csv("py-master/ML/9_decision_tree/Exercise/titanic.csv")

In [72]:
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [73]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [74]:
df_titanic.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [75]:
df_titanic.drop(["PassengerId","Name" ,"SibSp" , "Parch" , "Ticket" , "Cabin" , "Embarked"] , axis = "columns" , inplace = True)

In [76]:
target = df_titanic.drop(["Pclass" , "Sex" , "Age" , "Fare"] , axis = "columns")

In [77]:
target

     Survived
0           0
1           1
2           1
3           1
4           0
..        ...
886         0
887         1
888         0
889         1
890         0

[891 rows x 1 columns]

In [78]:
inputs = df_titanic.drop("Survived" , axis = "columns")
inputs

     Pclass     Sex   Age     Fare
0         3    male  22.0   7.2500
1         1  female  38.0  71.2833
2         3  female  26.0   7.9250
3         1  female  35.0  53.1000
4         3    male  35.0   8.0500
..      ...     ...   ...      ...
886       2    male  27.0  13.0000
887       1  female  19.0  30.0000
888       3  female   NaN  23.4500
889       1    male  26.0  30.0000
890       3    male  32.0   7.7500

[891 rows x 4 columns]

In [79]:
#checks for null values
inputs.isnull().sum()

Pclass      0
Sex         0
Age       177
Fare        0
dtype: int64

In [80]:
age_mean = inputs["Age"].mean()
age_mean

29.69911764705882

In [81]:
#replacing the missing values with the average
inputs["Age"] = inputs["Age"].fillna(age_mean)

In [82]:
#checks if it is still 
inputs["Age"].isnull().sum()

0

In [84]:
#converting the sex categories into numerical encoding 

from sklearn.preprocessing import LabelEncoder

In [85]:
Le_titanic = LabelEncoder()

In [86]:
inputs["Sex"] = Le_titanic.fit_transform(inputs["Sex"])

In [88]:
from sklearn import tree

In [89]:
model_titanic = tree.DecisionTreeClassifier()

In [90]:
model_titanic.fit(inputs , target)

DecisionTreeClassifier()

In [91]:
model_titanic.score(inputs , target)

0.9797979797979798

In [94]:
model_titanic.predict([[2,1,35,7]])

array([0], dtype=int64)